** Peeking under the hood

#+NAME: docker-osx-helpers
#+begin_src shell
ps ax | grep docker | awk '{print $5}' | sort | grep -v grep
#+end_src

#+RESULTS: docker-osx-helpers
#+begin_example
/Applications/Docker.app/Contents/MacOS/com.docker.backend
/Applications/Docker.app/Contents/MacOS/com.docker.supervisor
/Library/PrivilegedHelperTools/com.docker.vmnetd
com.docker.driver.amd64-linux
com.docker.hyperkit
com.docker.osxfs
com.docker.vpnkit
docker-mutagen
#+end_example

*** hyperkit args
With over 30 arguments, this underlying process/daemon is the docker VM itself.

#+NAME: com.docker.dockerkit args
#+begin_src shell
ps ax | grep com.docker.hyperkit | grep -v grep \
 | awk '{print $5,"\n",$6,$7,"\n",$8,$9,"\n",$10,$11,"\n",$12,$13,"\n",$14,$15,"\
",$16,$17,"\n",$18,$19,"\n",$20,$21,"\n",$22,$23,"\n",$24,$25,"\n",$26,$27,"\
",$28,$29,"\n",$30,$31,"\n",$32,$33,"\n",$34,$35,"\n",$36,$37}'
#+end_src

#+RESULTS: com.docker.dockerkit args
#+begin_example
com.docker.hyperkit
 -A -u
 -F vms/0/hyperkit.pid
 -c 8
 -m 24576M
 -s 0:0,hostbridge
 -s 31,lpc
 -s 1:0,virtio-vpnkit,path=vpnkit.eth.sock,uuid=24d0dc3f-f991-4505-9cc5-2ad42f28eac6
 -U 1054fd1e-ed24-45fa-8aaf-c762b26fc884
 -s 2:0,virtio-blk,/Users/hh/Library/Containers/com.docker.docker/Data/vms/0/data/Docker.raw
 -s 3,virtio-sock,guest_cid=3,path=vms/0,guest_forwards=2376;1525
 -s 4,ahci-cd,/Applications/Docker.app/Contents/Resources/linuxkit/docker-desktop.iso
 -s 5,ahci-cd,vms/0/config.iso
 -s 6,ahci-cd,/Applications/Docker.app/Contents/Resources/linuxkit/docker.iso
 -s 7,virtio-rnd
 -l com1,autopty=vms/0/tty,asl
 -f bootrom,/Applications/Docker.app/Contents/Resources/uefi/UEFI.fd,,
#+end_example

*** vpnkit args

With over 40 arguments, this underlying process/daemon connects the VM to the outside world.

#+NAME: com.docker.vpnkit args
#+begin_src shell
ps ax | grep com.docker.vpnkit | grep -v grep \
 | awk '{print $5,"\n",$6,$7,"\n",$8,$9,"\n",$10,$11,"\n",$12,$13,"\n",$14,$15,$16,"\
",$17,$18,"\n",$19,$20,"\n",$21,$22,"\n",$23,$24,"\n",$25,$26,$27,"\n",$28,$29,$30,"\
",$31,$32,"\n",$33,$34,"\n",$35,$36,"\n",$37,$38,"\n",$39,$40,"\n",$41,$42,"\
",$43,$44,"\n",$45,$46,"\n",$47,$48}'
#+end_src

#+RESULTS: com.docker.vpnkit args
#+begin_example
com.docker.vpnkit
 --ethernet fd:3
 --diagnostics fd:4
 --pcap fd:5
 --vsock-path vms/0/connect
 --gateway-forwards /Users/hh/Library/Group Containers/group.com.docker/gateway_forwards.json
 --host-names host.docker.internal,docker.for.mac.host.internal,docker.for.mac.localhost
 --listen-backlog 32
 --mtu 1500
 --allowed-bind-addresses 0.0.0.0
 --http /Users/hh/Library/Group Containers/group.com.docker/http_proxy.json
 --dhcp /Users/hh/Library/Group Containers/group.com.docker/dhcp.json
 --port-max-idle-time 300
 --max-connections 2000
 --gateway-ip 192.168.65.1
 --host-ip 192.168.65.2
 --lowest-ip 192.168.65.3
 --highest-ip 192.168.65.254
 --log-destination asl
 --udpv4-forwards 123:127.0.0.1:49405
 --gc-compact-interval 1800
#+end_example
*** start nsenter
https://github.com/justincormack/nsenter1

#+name: nsenter1
#+begin_src shell
  docker rm -f nsenter1
  docker run -d --name nsenter1 --privileged --pid=host justincormack/nsenter1 /bin/sleep 9999
#+end_src

#+RESULTS: nsenter1
#+begin_example
nsenter1
d4a4618ab4591a03e8caed9244a28bc53d30e63189f291076f2e30f3d13b098e
#+end_example
** ensure k8s is updated
#+begin_src shell :async yes
  cd `go env GOPATH`/src/k8s.io/kubernetes
  git remote -v
  git fetch origin master
  git status
#+end_src

#+RESULTS:
#+begin_example
On branch master
Your branch is up to date with 'origin/master'.

nothing to commit, working tree clean
#+end_example

** kind image

This image contains k8s build from src.

#+begin_src shell
  docker image ls | grep kindest/node\\\|kindest/base | head -2
#+end_src

#+RESULTS:
#+begin_example
kindest/node                                            latest                              2269496e1075        7 minutes ago       1.32GB
kindest/base                                            v20200726-5f02d4ed                  93310cab5bac        2 weeks ago         292MB
#+end_example

